{
	"landing": {
		"firstName": "Aidan",
		"lastName": "Reidel",
		"phoneNumber": "1 (971) 237-4657",
		"bio": "I am a fresh graduate of Portland State University's Bachelor of Computer Science program as of March, 21st, 2020. Now I am actively seeking employment in full stack engineering, site reliability engineering, accessibility, or related information technology fields with a team that will appreciate my flexibility, adaptability and upbeat attitude.",
    "email": "aidan.reidel@gmail.com",
    "linkedin": "https://www.linkedin.com/in/aidan-reidel/",
		"github": "https://github.com/aidanreidel",
		"twitter": "https://twitter.com/AidanReidel"
	},
	"experience": [
		{
				"position": "Full Stack Engineer",
				"organization": "Universal Design Lab - Portland State University",
				"aboutWork": "The Universal Design Lab received a grant from the federal government to design and build a braille teaching mobile application with the help of a local firm. My job was to improve and maintain the React Native mobile braille teaching app, React single page web application for the mobile app's content creation and AWS hosted Lambda, DynamoDB and EC2 based back end.",
				"fromDate": "December 2018",
				"toDate": "December 2020"
		},
		{
			"position": "Engineering Consultant",
			"organization": "CID AgTech",
			"aboutWork": "I work as a freelance full stack engineer and product design consultant for a local agricultural technology distribution and production startup.",
			"fromDate": "May 2018",
			"toDate": "Present"
		},
		{
			"position": "Full Stack Engineer",
			"organization": "Capstone - Portland State University",
			"aboutWork": "My work on my capstone team was focused on the website, or Presentation, portion of this project. We used the javascript framework Mithril with Bootstrap and custom CSS to make the fronted, Node and Express to make the API server and connected all of this with the Restoration team's MySQL database using docker containers.",
			"fromDate": "September 2019",
			"toDate": "March 2020"
		},
		{
			"position": "Sauté Chef",
			"organization": "Yakuza Lounge",
			"aboutWork": "I worked at a local Japanese Izakaya restaurant making gourmet small plates while paying my way through community college.",
			"fromDate": "June 2014",
			"toDate": "June 2017"
		}
	],
	"education": [{
			"university": "Portland State University",
			"degree": "Bachelor of Computer Science",
			"gpa": "GPA 3.79",
			"fromDate": "Fall 2018",
			"toDate": "Spring 2020"
		},
		{
			"university": "Portland Community College",
			"degree": "Associates of Arts Oregon Regional Transfer",
			"gpa": "GPA 3.39",
			"fromDate": "Winter 2015",
			"toDate": "Spring 2018"
		}
	],
	"skills": [
		{
			"name": "Lambda"
		},
		{
			"name": "DynamoDB"
		},
		{
			"name": "EC2"
		},
		{
			"name": "Amplify"
		},
		{
			"name": "Javascript"
		},
		{
			"name": "Node.js"
		},
		{
			"name": "React"
		},
		{
			"name": "React Native"
		},
		{
			"name": "Git"
		},
		{
			"name": "GitHub"
		},
		{
			"name": "Docker"
		},
		{
			"name": "Express Server"
		},
		{
			"name": "HTML"
		},
		{
			"name": "CSS"
		},
		{
			"name": "SQL"
		},
		{
			"name": "HCI"
		}
	],
	"interests": {
		"paragraphOne": "I appreciate Oregon's vast access to the great outdoors. I use every opportunity to get out into the backcountry for hiking and backpacking. I am also a hobby mechanic with a special place in my heart for aging Japanese Motorcycles and Cars. I enjoy driving these projects on the wonderful back roads of Oregon.",
		"paragraphTwo": "When I am not outside I like to cook for my friends and family using the skills I learned as an izakaya sauté chef. I also like fixing things around the house, playing video games and tinkering with personal projects that expand my skills as a programmer."
	},
	"awards": [{
			"awardDetail": "Cum Laude Honors - Portland State University"
		},
		{
			"awardDetail": "President's List - Portland State University, Portland Community College"
		},
		{
			"awardDetail": "Dean's List - Portland State University, Portland Community College"
		}
	]
}
